Revit 2024 API
BuiltInFailures.DPartFailures.DivideVolumesProfilesGapForWidthAll Property
 Division family cannot be used with the selected division gap for all widths of hosts
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DivideVolumesProfilesGapForWidthAll { get; }
Visual Basic
Public Shared ReadOnly Property DivideVolumesProfilesGapForWidthAll As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DivideVolumesProfilesGapForWidthAll {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace